app/controllers/api/v1/articles_controller.rb

  def create
    article = Article.new(article_params)
    article.user = current_user
    if article.save
---
INSERT INTO "articles" ("title", "description", "url", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "asdf"], ["description", "asdf"], ["url", "asdf"], ["user_id", 1]]